libxmlbus/data/wsaddr-testset/documents/echo/soap12/duplicateFaultToRequest.xml

<?xml version="1.0"?>
<!-- $Id: duplicateFaultToRequest.xml,v 1.6 2006/02/20 16:01:17 pdowney Exp $ -->
<soap12:Envelope xmlns:soap12="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://www.w3.org/2005/08/addressing">
  <soap12:Header>
    <wsa:To>http://example.org/node/A</wsa:To>
    <wsa:Action>http://example.org/action/echoIn</wsa:Action>
    <wsa:MessageID>urn:uuid:70095F58-5D7E-4049-B351-60B77D11016A</wsa:MessageID>
    <wsa:FaultTo>
      <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
    </wsa:FaultTo>
    <wsa:FaultTo>
      <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
    </wsa:FaultTo>
  </soap12:Header>
  <soap12:Body>
    <m:echoIn xmlns:m="http://example.org/echo">Echo This Text</m:echoIn>
  </soap12:Body>
</soap12:Envelope>
